#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu

#include "Basic.hpp"

#include "GameLogoEnum_structs.hpp"
#include "Engine_structs.hpp"
#include "BrickRigs_structs.hpp"
#include "BrickRigs_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu.WBP_Menu_C
// 0x0028 (0x0318 - 0x02F0)
class UWBP_Menu_C final : public UMenuWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_GameLogo_C*                        Logo;                                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickBorder*                           MenuPageBorder;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickTextBlock*                        VersionTextBlock;                                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FPopupHandle                           PopupHandle;                                       // 0x0310(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void CreateAdminMenuButton();
	void CreateBackButton();
	void OnMenuContextChanged(const class FName& NewContext);
	void AddMenuPage(class UMenuPageWidget* Widget);
	void OnClickedOptions();
	void OnClickedHostGame();
	void OnClickedJoinGame();
	void OnClickedGameplaySettings();
	void OnClickedVideoSettings();
	void OnClickedInputSettings();
	void OnClickedCredits();
	void OnClickedUISettings();
	void OnClosedQuitGamePopup(EPopupResult Result);
	void OnClickedMatchMenu();
	void OnClickedAdminSettings();
	void OnClickedPlayersMenu();
	void OnClickedInputMappings();
	void OnClickedEditorSettings();
	void OnClickedMainMenu();
	void OnClosedMainMenuPopup(EPopupResult Result);
	void OnClickedQuickGame();
	void RemoveMenuPage(class UMenuPageWidget* Widget);
	void OnInitialized();
	void ExecuteUbergraph_WBP_Menu(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_C">();
	}
	static class UWBP_Menu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_C>();
	}
};
static_assert(alignof(UWBP_Menu_C) == 0x000008, "Wrong alignment on UWBP_Menu_C");
static_assert(sizeof(UWBP_Menu_C) == 0x000318, "Wrong size on UWBP_Menu_C");
static_assert(offsetof(UWBP_Menu_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_Menu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_C, Logo) == 0x0002F8, "Member 'UWBP_Menu_C::Logo' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_C, MenuPageBorder) == 0x000300, "Member 'UWBP_Menu_C::MenuPageBorder' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_C, VersionTextBlock) == 0x000308, "Member 'UWBP_Menu_C::VersionTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_C, PopupHandle) == 0x000310, "Member 'UWBP_Menu_C::PopupHandle' has a wrong offset!");

}

